espressif/esp-usb/host/usb/test/target_test/hcd/sdkconfig.ci.esp32s31_psram
CONFIG_IDF_TARGET="esp32s31"

# Enable PSRAM and set PSRAM frequency
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_MEMTEST is not set

# Allocate USB_DWC DMA capable memory in PSRAM
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y
